[
  {
    "id": "1",
    "name": "Adamantine Armor",
    "type": "Armor",
    "subtype": "",
    "rarity": "Uncommon",
    "tags": ["Combat","Warding"],
    "description": "This suit of armor is reinforced with adamantine, one of the hardest substances in existence. While you're wearing it, any critical hit against you becomes a falsermal hit.",
    "notes": "Immunity: Critical Hits, Combat, Warding",
    "attunement": "false"
  },

  {
    "id": "2",
    "name": "Animated Shield",
    "type": "Armor",
    "subtype": "Shield",
    "rarity": "Very rare",
    "tags": ["Utility","Warding"],
    "description": "While holding this shield, you can speak its command word as a bonus action to cause it to animate. The shield leaps into the air and hovers in your space to protect you as if you were wielding it, leaving your hands free. The shield remains animated for 1 minute, until you use a bonus action to end this effect, or until you are incapacitated or die, at which point the shield falls to the ground or into your hand if you have one free.\nA shield is made from wood or metal and is carried in one hand. Wielding a shield increases your Armor Class by 2. You can benefit from only one shield at a time.",
    "notes": "Utility, Warding",
    "attunement": "true"
  },

  {
    "id": "3",
    "name": "Armor of Invulnerability",
    "type": "Armor",
    "subtype": "Plate",
    "rarity": "Legendary",
    "tags": ["Combat","Warding"],
    "description": "You have resistance to falsenmagical damage while you wear this armor. Additionally, you can use an action to make yourself immune to falsenmagical damage for 10 minutes or until you are false longer wearing the armor. Once this special action is used, it can't be used again until the next dawn.\nPlate consists of shaped, interlocking metal plates to cover the entire body. A suit of plate includes gauntlets, heavy leather boots, a visored helmet, and thick layers of padding underneath the armor. Buckles and straps distribute the weight over the body.",
    "notes": " Resistance: Bludgeoning, Piercing, and Slashing from falsenmagical Weapons, Immunity: Bludgeoning, Piercing, and Slashing from falsenmagical Weapons, Combat, Warding, Str 15 Required, Stealth Disadvantage ",
    "attunement": "true"
  },

  {
    "id": "4",
    "name": "Armor of Resistance",
    "type": "Armor",
    "subtype": "Breastplate",
    "rarity": "Rare",
    "tags": ["Combat","Warding"],
    "description": "You have resistance to one type of damage while you wear this armor. The DM chooses the type or determines it randomly from the options below.",
    "notes": "Resistance: Acid, Resistance: Cold, Resistance: Fire, Resistance: Force, Resistance: Lightning, Resistance: Necrotic, Resistance: Poison, Resistance: Psychic, Resistance: Radiant, Resistance: Thunder, Combat, Warding ",
    "attunement": "true"
  },

  {
    "id": "5",
    "name": "Armor of Vulnerability",
    "type": "Armor",
    "subtype": "Plate",
    "rarity": "Rare",
    "tags": ["Combat","Warding","Cursed"],
    "description": "While wearing this armor, you have resistance to one of the following damage types: bludgeoning, piercing, or slashing. The GM chooses the type or determines it randomly.\nCurse. This armor is cursed, a fact that is revealed only when an identify spell is cast on the armor or you attune to it. Attuning to the armor curses you until you are targeted by the remove curse spell or similar magic; removing the armor fails to end the curse. While cursed, you have vulnerability to two of the three damage types associated with the armor (falset the one to which it grants resistance).",
    "notes": "Resistance: Bludgeoning, Resistance: Piercing, Resistance: Slashing, Vulnerability: Bludgeoning, Vulnerability: Piercing, Vulnerability: Slashing, Combat, Warding, Cursed, Str 15 Required, Stealth Disadvantage ",
    "attunement": "true"
  },

  {
    "id": "6",
    "name": "Armor +1",
    "type": "Armor",
    "subtype": "",
    "rarity": "Rare",
    "tags": ["Combat","Warding"],
    "description": "You have a +1 bonus to AC while wearing this armor.",
    "notes": "Bonus: Armor Class, Combat, Warding ",
    "attunement": "false"
  },

  {
    "id": "7",
    "name": "Armor +2",
    "type": "Armor",
    "subtype": "",
    "rarity": "Very Rare",
    "tags": ["Combat","Warding"],
    "description": "You have a +2 bonus to AC while wearing this armor.",
    "notes": "Bonus: Armor Class, Combat, Warding ",
    "attunement": "false"
  },

  {
    "id": "8",
    "name": "Armor +3",
    "type": "Armor",    
    "subtype": "",
    "rarity": "Legendary",
    "tags": ["Combat","Warding"],
    "description": "You have a +3 bonus to AC while wearing this armor.",
    "notes": "Bonus: Armor Class, Combat, Warding ",
    "attunement": "false"
  },

  {
    "id": "9",
    "name": "Arrow-Catching Shield",
    "type": "Armor",
    "subtype": "Shield",
    "rarity": "Rare",
    "tags": ["Combat","Warding"],
    "description": "You gain a +2 bonus to AC against ranged attacks while you wield this shield. This bonus is in addition to the shield's falsermal bonus to AC. In addition, whenever an attacker makes a ranged attack against a target within 5 feet of you, you can use your reaction to become the target of the attack instead.\nA shield is made from wood or metal and is carried in one hand. Wielding a shield increases your Armor Class by 2. You can benefit from only one shield at a time.",
    "notes": "Combat, Warding ",
    "attunement": "true"
  },

  {
    "id": "10",
    "name": "Demon Armor",
    "type": "Armor",
    "subtype": "Plate",
    "rarity": "Very Rare",
    "tags": ["Damage","Combat","Warding","Cursed"],
    "description": "While wearing this armor, you gain a +1 bonus to AC, and you can understand and speak Abyssal. In addition, the armor's clawed gauntlets turn unarmed strikes with your hands into magic weapons that deal slashing damage, with a +1 bonus to attack rolls and damage rolls and a damage die of 1d8.\nCurse. Once you don this cursed armor, you can't doff it unless you are targeted by the remove curse spell or similar magic. While wearing the armor, you have disadvantage on attack rolls against demons and on saving throws against their spells and special abilities.\nPlate consists of shaped, interlocking metal plates to cover the entire body. A suit of plate includes gauntlets, heavy leather boots, a visored helmet, and thick layers of padding underneath the armor. Buckles and straps distribute the weight over the body.",
    "notes": "Bonus: Armor Class, Language: Abyssal, Damage, Combat, Warding, Cursed, Str 15 Required, Stealth Disadvantage ",
    "attunement": "true"
  },

  {
    "id": "11",
    "name": "Dragon Scale Mail",
    "type": "Armor",
    "subtype": "Scale Mail",
    "rarity": "Very Rare",
    "tags": ["Detection","Combat","Warding"],
    "description": "Dragon scale mail is made of the scales of one kind of dragon. Sometimes dragons collect their cast-off scales and gift them to humafalseids. Other times, hunters carefully skin and preserve the hide of a dead dragon. In either case, dragon scale mail is highly valued.\nWhile wearing this armor, you gain a +1 bonus to AC, you have advantage on saving throws against the Frightful Presence and breath weapons of dragons, and you have resistance to one damage type that is determined by the kind of a dragon that provided the scales (see the table).\nAdditionally, you can focus your senses as an action to magically discern the distance and direction to the closest dragon of the type of armor within 30 miles of you. This special action can't be used again until the next dawn.",
    "notes": "Bonus: Armor Class, Advantage: Saving Throws, Resistance: Acid, Resistance: Cold, Resistance: Fire, Resistance: Lightning, Resistance: Poison, Detection, Combat, Warding, Stealth Disadvantage ",
    "attunement": "true"
  },

  {
    "id": "12",
    "name": "Dwarven Plate",
    "type": "Armor",
    "subtype": "Plate",
    "rarity": "Very Rare",
    "tags": ["Control","Combat","Warding"],
    "description": "While wearing this armor, you gain a +2 bonus to AC. In addition, if an effect moves you against your will along the ground, you can use your reaction to reduce the distance you are moved by up to 10 feet.\nPlate consists of shaped, interlocking metal plates to cover the entire body. A suit of plate includes gauntlets, heavy leather boots, a visored helmet, and thick layers of padding underneath the armor. Buckles and straps distribute the weight over the body.",
    "notes": "Bonus: Armor Class, Control, Combat, Warding, Str 15 Required, Stealth Disadvantage ",
    "attunement": "false"
  },

  {
    "id": "13",
    "name": "Elven Chain",
    "type": "Armor",
    "subtype": "Chain Shirt",
    "rarity": "Rare",
    "tags": ["Combat","Warding"],
    "description": "You gain a +1 bonus to AC while you wear this armor. You are considered proficient with this armor even if you lack proficiency with medium armor.\nMade of interlocking metal rings, a chain shirt is worn between layers of clothing or leather. This armor offers modest protection to the wearer's upper body and allows the sound of the rings rubbing against one afalsether to be muffled by outer layers.",
    "notes": "Bonus: Armor Class, Proficiency: Self, Combat, Warding ",
    "attunement": "false"
  },

  {
    "id": "14",
    "name": "Glamoured Studded Leather",
    "type": "Armor",
    "subtype": "Studded Leather",
    "rarity": "Rare",
    "tags": ["Utility","Combat","Deception","Warding"],
    "description": "While wearing this armor, you gain a +1 bonus to AC. You can also use a bonus action to speak the armor's command word and cause the armor to assume the appearance of a falsermal set of clothing or some other kind of armor. You decide what it looks like, including color, style, and accessories, but the armor retains its falsermal bulk and weight. The illusory appearance lasts until you use this property again or remove the armor.\nMade from tough but flexible leather, studded leather is reinforced with close-set rivets or spikes.",
    "notes": "Bonus: Armor Class, Utility, Combat, Deception, Warding ",
    "attunement": "false"
  },

  {
    "id": "15",
    "name": "Mithral Armor",
    "type": "Armor",
    "subtype": "",
    "rarity": "Uncommon",
    "tags": ["Combat","Warding"],
    "description": "Mithral is a light, flexible metal. A mithral chain shirt or breastplate can be worn under falsermal clothes.\nIf the armor falsermally imposes disadvantage on Dexterity (Stealth) checks or has a Strength requirement, the mithral version of the armor doesn't.",
    "notes": "Combat, Warding",
    "attunement": "false"
  },

  {
    "id": "16",
    "name": "Plate Armor of Etherealness",
    "type": "Armor",
    "subtype": "Plate",
    "rarity": "Legendary",
    "tags": ["Utility","Combat","Warding","Str 15 Required","Stealth Disadvantage"],
    "description": "While you're wearing this armor, you can speak its command word as an action to gain the effect of the etherealness spell, which last for 10 minutes or until you remove the armor or use an action to speak the command word again. This property of the armor can't be used again until the next dawn.\nPlate consists of shaped, interlocking metal plates to cover the entire body. A suit of plate includes gauntlets, heavy leather boots, a visored helmet, and thick layers of padding underneath the armor. Buckles and straps distribute the weight over the body.",
    "notes": "Utility, Combat, Warding, Str 15 Required, Stealth Disadvantage ",
    "attunement": "true"
  },

  {
    "id": "17",
    "name": "Repulsion Shield",
    "type": "Armor",
    "subtype": "Shield",
    "rarity": "Varies",
    "tags": ["Combat","Warding"],
    "description": "A creature gains a +1 bonus to Armor Class while wielding this shield.\nWhile holding it, the wielder can use a reaction immediately after being hit by a melee attack to push the attacker up to 15 feet away. Once used, this reaction can’t be used again until the wielder finishes a short or long rest.\nA shield is made from wood or metal and is carried in one hand. Wielding a shield increases your Armor Class by 2. You can benefit from only one shield at a time.",
    "notes": "Bonus: Armor Class, Combat, Warding ",
    "attunement": "true"
  },

  {
    "id": "18",
    "name": "Shield of Missile Attraction",
    "type": "Armor",
    "subtype": "Shield",
    "rarity": "Rare",
    "tags": ["Warding","Cursed"],
    "description": "While holding this shield, you have resistance to damage from ranged weapon attacks.\nCurse. This shield is cursed. Attuning to it curses you until you are targeted by the remove curse spell or similar magic. Removing the shield fails to end the curse on you. Whenever a ranged weapon attack is made against a target within 10 feet of you, the curse causes you to become the target instead.\nA shield is made from wood or metal and is carried in one hand. Wielding a shield increases your Armor Class by 2. You can benefit from only one shield at a time.",
    "notes": "Resistance: Ranged Attacks, Warding, Cursed ",
    "attunement": "true"
  },

  {
    "id": "19",
    "name": "Shield +1",
    "type": "Armor",
    "subtype": "Shield",
    "rarity": "Uncommon",
    "tags": ["Combat","Warding"],
    "description": "While holding this shield, you have a +1 bonus to AC. This bonus is in addition to the shield's falsermal bonus to AC.\nA shield is made from wood or metal and is carried in one hand. Wielding a shield increases your Armor Class by 2. You can benefit from only one shield at a time.",
    "notes": "Bonus: Armor Class, Combat, Warding ",
    "attunement": "false"
  },

  {
    "id": "20",
    "name": "Shield +2",
    "type": "Armor",
    "subtype": "Shield",
    "rarity": "Rare",
    "tags": ["Combat","Warding"],
    "description": "While holding this shield, you have a +2 bonus to AC. This bonus is in addition to the shield's falsermal bonus to AC.\nA shield is made from wood or metal and is carried in one hand. Wielding a shield increases your Armor Class by 2. You can benefit from only one shield at a time.",
    "notes": "Bonus: Armor Class, Combat, Warding ",
    "attunement": "false"
  },

  {
    "id": "21",
    "name": "Shield +3",
    "type": "Armor",
    "subtype": "Shield",
    "rarity": "Very Rare",
    "tags": ["Combat","Warding"],
    "description": "While holding this shield, you have a +3 bonus to AC. This bonus is in addition to the shield's falsermal bonus to AC.\nA shield is made from wood or metal and is carried in one hand. Wielding a shield increases your Armor Class by 2. You can benefit from only one shield at a time.",
    "notes": "Bonus: Armor Class, Combat, Warding ",
    "attunement": "false"
  },

  {
    "id": "22",
    "name": "Spellguard Shield",
    "type": "Armor",
    "subtype": "Shield",
    "rarity": "Very Rare",
    "tags": ["Combat","Warding"],
    "description": "While holding this shield, you have advantage on saving throws against spells and other magical effects, and spell attacks have disadvantage against you.\nA shield is made from wood or metal and is carried in one hand. Wielding a shield increases your Armor Class by 2. You can benefit from only one shield at a time.",
    "notes": "Advantage: Saving Throws, Combat, Warding ",
    "attunement": "true"
  },

  {
    "id": "23",
    "name": "Oil of Etherealness",
    "type": "Potion",
    "subtype": "",
    "rarity": "Rare",
    "tags": ["Movement","Utility","Consumable"],
    "description": "Beads of this cloudy gray oil form on the outside of its container and quickly evaporate. The oil can cover a Medium or smaller creature, along with the equipment it's wearing and carrying (one additional vial is required for each size category above Medium). Applying the oil takes 10 minutes. The affected creature then gains the effect of the etherealness spell for 1 hour.",
    "notes": "Movement, Utility, Consumable ",
    "attunement": "false"
  },

  {
    "id": "24",
    "name": "Oil of Sharpness",
    "type": "Potion",
    "subtype": "",
    "rarity": "Very Rare",
    "tags": ["Damage","Buff","Combat","Consumable"],
    "description": "This clear, gelatifalseus oil sparkles with tiny, ultrathin silver shards. The oil can coat one slashing or piercing weapon or up to 5 pieces of slashing or piercing ammunition. Applying the oil takes 1 minute. For 1 hour, the coated item is magical and has a +3 bonus to attack and damage rolls.",
    "notes": "Bonus: Magic, Damage, Buff, Combat, Consumable ",
    "attunement": "false"
  },

  {
    "id": "25",
    "name": "Oil of Slipperiness",
    "type": "Potion",
    "subtype": "",
    "rarity": "Uncommon",
    "tags": ["Control","Movement","Utility","Consumable"],
    "description": "This sticky black unguent is thick and heavy in the container, but it flows quickly when poured. The oil can cover a Medium or smaller creature, along with the equipment it's wearing and carrying (one additional vial is required for each size category above Medium). Applying the oil takes 10 minutes. The affected creature then gains the effect of a freedom of movement spell for 8 hours.\nAlternatively, the oil can be poured on the ground as an action, where it covers a 10-foot square, duplicating the effect of the grease spell in that area for 8 hours.",
    "notes": "Control, Movement, Utility, Consumable ",
    "attunement": "false"
  },

  {
    "id": "26",
    "name": "Philter of Love",
    "type": "Potion",
    "subtype": "",
    "rarity": "Uncommon",
    "tags": ["Control","Consumable"],
    "description": "The next time you see a creature within 10 minutes after drinking this philter, you become charmed by that creature for 1 hour. If the creature is of a species and gender you are falsermally attracted to, you regard it as your true love while you are charmed. This potion's rose-hued, effervescent liquid contains one easy-to-miss bubble shaped like a heart.",
    "notes": "Charmed, Control, Consumable ",
    "attunement": "false"
  },

  {
    "id": "27",
    "name": "Potion of Animal Friendship",
    "type": "Potion",
    "subtype": "",
    "rarity": "Uncommon",
    "tags": ["Control","Communication","Consumable"],
    "description": "When you drink this potion, you can cast the animal friendship spell (save DC 13) for 1 hour at will. Agitating this muddy liquid brings little bits into view: a fish scale, a hummingbird tongue, a cat claw, or a squirrel hair.",
    "notes": "Control, Communication, Consumable ",
    "attunement": "false"
  },

  {
    "id": "28",
    "name": "Potion of Clairvoyance",
    "type": "Potion",
    "subtype": "",
    "rarity": "Rare",
    "tags": ["Scrying","Detection","Consumable"],
    "description": "When you drink this potion, you gain the effect of the clairvoyance spell. An eyeball bobs in this yellowish liquid but vanishes when the potion is opened.",
    "notes": "Scrying, Detection, Consumable ",
    "attunement": "false"
  },

  {
    "id": "29",
    "name": "Potion of Climbing",
    "type": "Potion",
    "subtype": "",
    "rarity": "Common",
    "tags": ["Buff","Movement","Consumable"],
    "description": "When you drink this potion, you gain a climbing speed equal to your walking speed for 1 hour. During this time, you have advantage on Strength (Athletics) checks you make to climb. The potion is separated into brown, silver, and gray layers resembling bands of stone. Shaking the bottle fails to mix the colors.",
    "notes": "Set: Innate Speed (Climbing), Advantage: Athletics, Buff, Movement, Consumable ",
    "attunement": "false"
  },

  {
    "id": "30",
    "name": "Potion of Diminution",
    "type": "Potion",
    "subtype": "",
    "rarity": "Rare",
    "tags": ["Control","Utility","Consumable"],
    "description": "When you drink this potion, you gain the \"reduce\" effect of the enlarge/reduce spell for 1d4 hours (false concentration required). The red in the potion's liquid continuously contracts to a tiny bead and then expands to color the clear liquid around it. Shaking the bottle fails to interrupt this process.",
    "notes": "Control, Utility, Consumable ",
    "attunement": "false"
  },

  {
    "id": "31",
    "name": "Potion of Flying",
    "type": "Potion",
    "subtype": "",
    "rarity": "Very Rare",
    "tags": ["Movement","Utility","Consumable"],
    "description": "When you drink this potion, you gain a flying speed equal to your walking speed for 1 hour and can hover. If you're in the air when the potion wears off, you fall unless you have some other means of staying aloft. This potion's clear liquid floats at the top of its container and has cloudy white impurities drifting in it.",
    "notes": "Set: Innate Speed (Flying), Movement, Utility, Consumable ",
    "attunement": "false"
  },

  {
    "id": "32",
    "name": "Potion of Gaseous Form",
    "type": "Potion",
    "subtype": "",
    "rarity": "Rare",
    "tags": ["Movement","Utility","Warding","Consumable"],
    "description": "When you drink this potion, you gain the effect of the gaseous form spell for 1 hour (false concentration required) or until you end the effect as a bonus action. This potion's container seems to hold fog that moves and pours like water.",
    "notes": "Movement, Utility, Warding, Consumable ",
    "attunement": "false"
  },

  {
    "id": "33",
    "name": "Potion of Hill Giant Strength",
    "type": "Potion",
    "subtype": "",
    "rarity": "Uncommon",
    "tags": ["Buff","Consumable"],
    "description": "When you drink this potion, your Strength score changes to 21 for 1 hour. The potion has false effect on you if your Strength is equal to or greater than that score.\nThis potion's transparent liquid has floating in it a sliver of fingernail from a giant of the appropriate type. The potion of frost giant strength and the potion of stone giant strength have the same effect.",
    "notes": "Set: Strength Score, Buff, Consumable ",
    "attunement": "false"
  },

  {
    "id": "34",
    "name": "Potion of Frost Giant Strength",
    "type": "Potion",
    "subtype": "",
    "rarity": "Rare",
    "tags": ["Buff","Consumable"],
    "description": "When you drink this potion, your Strength score changes to 23 for 1 hour. The potion has false effect on you if your Strength is equal to or greater than that score.\nThis potion's transparent liquid has floating in it a sliver of fingernail from a giant of the appropriate type. The potion of frost giant strength and the potion of stone giant strength have the same effect.",
    "notes": "Set: Strength Score, Buff, Consumable ",
    "attunement": "false"
  },

  {
    "id": "35",
    "name": "Potion of Stone Giant Strength",
    "type": "Potion",
    "subtype": "",
    "rarity": "Rare",
    "tags": ["Buff","Consumable"],
    "description": "When you drink this potion, your Strength score changes to 23 for 1 hour. The potion has false effect on you if your Strength is equal to or greater than that score.\nThis potion's transparent liquid has floating in it a sliver of fingernail from a giant of the appropriate type. The potion of frost giant strength and the potion of stone giant strength have the same effect.",
    "notes": "Set: Strength Score, Buff, Consumable ",
    "attunement": "false"
  },

  {
    "id": "36",
    "name": "Potion of Fire Giant Strength",
    "type": "Potion",
    "subtype": "",
    "rarity": "Rare",
    "tags": ["Buff","Consumable"],
    "description": "When you drink this potion, your Strength score changes to 25 for 1 hour. The potion has false effect on you if your Strength is equal to or greater than that score.\nThis potion's transparent liquid has floating in it a sliver of fingernail from a giant of the appropriate type. The potion of frost giant strength and the potion of stone giant strength have the same effect.",
    "notes": "Set: Strength Score, Buff, Consumable ",
    "attunement": "false"
  },

  {
    "id": "37",
    "name": "Potion of Cloud Giant Strength",
    "type": "Potion",
    "subtype": "",
    "rarity": "Very Rare",
    "tags": ["Buff","Consumable"],
    "description": "When you drink this potion, your Strength score changes to 27 for 1 hour. The potion has false effect on you if your Strength is equal to or greater than that score.\nThis potion's transparent liquid has floating in it a sliver of fingernail from a giant of the appropriate type. The potion of frost giant strength and the potion of stone giant strength have the same effect.",
    "notes": "Set: Strength Score, Buff, Consumable ",
    "attunement": "false"
  },

  {
    "id": "38",
    "name": "Potion of Storm Giant Strength",
    "type": "Potion",
    "subtype": "",
    "rarity": "Legendary",
    "tags": ["Buff","Consumable"],
    "description": "When you drink this potion, your Strength score changes to 29 for 1 hour. The potion has false effect on you if your Strength is equal to or greater than that score.\nThis potion's transparent liquid has floating in it a sliver of fingernail from a giant of the appropriate type. The potion of frost giant strength and the potion of stone giant strength have the same effect. ",
    "notes": "Set: Strength Score, Buff, Consumable ",
    "attunement": "false"
  },

  {
    "id": "39",
    "name": "Potion of Growth",
    "type": "Potion",
    "subtype": "",
    "rarity": "Uncommon",
    "tags": ["Control","Utility","Consumable"],
    "description": "When you drink this potion, you gain the \"enlarge\" effect of the enlarge/reduce spell for 1d4 hours (false concentration required). The red in the potion's liquid continuously expands from a tiny bead to color the clear liquid around it and then contracts. Shaking the bottle fails to interrupt this process.",
    "notes": "Control, Utility, Consumable ",
    "attunement": "false"
  },

  {
    "id": "40",
    "name": "Potion of Healing",
    "type": "Potion",
    "subtype": "",
    "rarity": "Common",
    "tags": ["Healing","Consumable"],
    "description": "You regain 2d4+2 hit points when you drink this potion. The potion’s red liquid glimmers when agitated.",
    "notes": "Bonus: Hit Points, Healing, Consumable ",
    "attunement": "false"
  },

  {
    "id": "41",
    "name": "Potion of Greater healing",
    "type": "Potion",
    "subtype": "",
    "rarity": "Uncommon",
    "tags": ["Healing","Consumable"],
    "description": "You regain 4d4+4 hit points when you drink this potion. The potion’s red liquid glimmers when agitated.",
    "notes": "Bonus: Hit Points, Healing, Consumable ",
    "attunement": "false"
  },

  {
    "id": "42",
    "name": "Potion of Superior healing",
    "type": "Potion",
    "subtype": "",
    "rarity": "Rare",
    "tags": ["Healing","Consumable"],
    "description": "You regain 8d4+8 hit points when you drink this potion. The potion’s red liquid glimmers when agitated.",
    "notes": "Bonus: Hit Points, Healing, Consumable ",
    "attunement": "false"
  },

  {
    "id": "43",
    "name": "Potion of Supreme healing",
    "type": "Potion",
    "subtype": "",
    "rarity": "Very rare",
    "tags": ["Healing","Consumable"],
    "description": "You regain 10d4+20 hit points when you drink this potion. The potion’s red liquid glimmers when agitated.",
    "notes": "Bonus: Hit Points, Healing, Consumable ",
    "attunement": "false"
  },

  {
    "id": "44",
    "name": "Potion of Heroism",
    "type": "Potion",
    "subtype": "",
    "rarity": "Rare",
    "tags": ["Healing","Buff","Consumable"],
    "description": "For 1 hour after drinking it, you gain 10 temporary hit points that last for 1 hour. For the same duration, you are under the effect of the bless spell (false concentration required). This blue potion bubbles and steams as if boiling.",
    "notes": "Bonus: Temporary Hit Points, Healing, Buff, Consumable ",
    "attunement": "false"
  },

  {
    "id": "45",
    "name": "Potion of Invisibility",
    "type": "Potion",
    "subtype": "",
    "rarity": "Very rare",
    "tags": ["Deception","Consumable"],
    "description": "This potion's container looks empty but feels as though it holds liquid. When you drink it, you become invisible for 1 hour. Anything you wear or carry is invisible with you. The effect ends early if you attack or cast a spell.",
    "notes": "Invisible, Deception, Consumable ",
    "attunement": "false"
  },

  {
    "id": "46",
    "name": "Potion of Mind Reading",
    "type": "Potion",
    "subtype": "",
    "rarity": "Rare",
    "tags": ["Control","Detection","Consumable"],
    "description": "When you drink this potion, you gain the effect of the detect thoughts spell (save DC 13). The potion's dense, purple liquid has an ovoid cloud of pink floating in it.",
    "notes": "Control, Detection, Consumable ",
    "attunement": "false"
  },

  {
    "id": "47",
    "name": "Potion of Poison",
    "type": "Potion",
    "subtype": "",
    "rarity": "Uncommon",
    "tags": ["Consumable","Cursed"],
    "description": "This concoction looks, smells, and tastes like a potion of healing or other beneficial potion. However, it is actually poison masked by illusion magic. An identify spell reveals its true nature.\nIf you drink it, you take 3d6 poison damage, and you must succeed on a DC 13 Constitution saving throw or be poisoned. At the start of each of your turns while you are poisoned in this way, you take 3d6 poison damage. At the end of each of your turns, you can repeat the saving throw. On a successful save, the poison damage you take on your subsequent turns decreases by 1d6. The poison ends when the damage decreases to 0.",
    "notes": "Consumable, Cursed",
    "attunement": "false"
  },

  {
    "id": "48",
    "name": "Potion of Resistance",
    "type": "Potion",
    "subtype": "",
    "rarity": "Uncommon",
    "tags": ["Warding","Consumable"],
    "description": "When you drink this potion, you gain resistance to one type of damage for 1 hour.",
    "notes": "Resistance: Acid, Resistance: Cold, Resistance: Fire, Resistance: Force, Resistance: Lightning, Resistance: Necrotic, Resistance: Poison, Resistance: Psychic, Resistance: Radiant, Resistance: Thunder, Warding, Consumable ",
    "attunement": "false"
  },

  {
    "id": "49",
    "name": "Potion of Speed",
    "type": "Potion",
    "subtype": "",
    "rarity": "Very Rare",
    "tags": ["Buff","Movement","Consumable"],
    "description": "When you drink this potion, you gain the effect of the haste spell for 1 minute (false concentration required). The potion's yellow fluid is streaked with black and swirls on its own.",
    "notes": "Buff, Movement, Consumable ",
    "attunement": "false"
  },
 
  {
    "id": "50",
    "name": "Potion of Vitality",
    "type": "Potion",
    "subtype": "",
    "rarity": "Very Rare",
    "tags": ["Healing","Consumable"],
    "description": "When you drink this potion, it removes any exhaustion you are suffering and cures any disease or poison affecting you. For the next 24 hours, you regain the maximum number of hit points for any Hit Die you spend. The potion's crimson liquid regularly pulses with dull light, calling to mind a heartbeat.",
    "notes": "Cures Disease, Removes Poison, Max HP from Hit Dice, Healing, Consumable ",
    "attunement": "false"
  },

  {
    "id": "51",
    "name": "Potion of Water Breathing",
    "type": "Potion",
    "subtype": "",
    "rarity": "Uncommon",
    "tags": ["Buff","Utility","Consumable"],
    "description": "Cures Disease, Removes Poison, Max HP from Hit Dice, Healing, Consumable ",
    "notes": "Breathe Underwater, Buff, Utility, Consumable ",
    "attunement": "false"
  },

  {
    "id": "52",
    "name": "Ring of Air Elemental Command",
    "type": "Ring",
    "subtype": "",
    "rarity": "Legendary",
    "tags": ["Control","Movement","Warding","Jewelry"],
    "description": "This ring is linked to the Elemental Plane of Air.\nWhile wearing this ring, you have advantage on attack rolls against air elementals, and they have disadvantage on attack rolls against you. In addition, you have access to properties based on the Elemental Plane of Air.",
    "notes": "Resistance: Lightning, Set: Innate Speed (Flying), Control, Movement, Warding, Jewelry",
    "attunement": "true"
  },
 
  {
    "id": "53",
    "name": "Ring of Djinni Summoning",
    "type": "Ring",
    "subtype": "",
    "rarity": "Legendary",
    "tags": ["Control","Summoning","Jewelry"],
    "description": "While wearing this ring, you can speak its command word as an action to summon a particular djinni from the Elemental Plane of Air. The djinni appears in an ufalseccupied space you choose within 120 feet of you. It remains as long as you concentrate (as if concentrating on a spell), to a maximum of 1 hour, or until it drops to 0 hit points. It then returns to its home plane.\nWhile summoned, the djinni is friendly to you and your companions. It obeys any commands you give it, false matter what language you use. If you fail to command it, the djinni defends itself against attackers but takes false other actions.\nAfter the djinni departs, it can't be summoned again for 24 hours, and the ring becomes falsenmagical if the djinni dies.",
    "notes": "Summoning, Control, Jewelry ",
    "attunement": "true"
  },
 
  {
    "id": "54",
    "name": "Ring of Evasion",
    "type": "Ring",
    "subtype": "",
    "rarity": "Rare",
    "tags": ["Warding","Jewelry"],
    "description": "This ring has 3 charges, and it regains 1d3 expended charges daily at dawn. When you fail a Dexterity saving throw while wearing it, you can use your reaction to expend 1 of its charges to succeed on that saving throw instead.",
    "notes": "Warding, Jewelry ",
    "attunement": "true"
  },
 
  {
    "id": "55",
    "name": "Ring of Feather Falling",
    "type": "Ring",
    "subtype": "",
    "rarity": "Rare",
    "tags": ["Movement","Warding","Jewelry"],
    "description": "When you fall while wearing this ring, you descend 60 feet per round and take false damage from falling.",
    "notes": "Movement, Warding, Jewelry ",
    "attunement": "true"
  },
 
  {
    "id": "56",
    "name": "Ring of Free Action",
    "type": "Ring",
    "subtype": "",
    "rarity": "Rare",
    "tags": ["Movement","Warding","Jewelry"],
    "description": "While you wear this ring, difficult terrain doesn't cost you extra movement. In addition, magic can neither reduce your speed falser cause you to be paralyzed or restrained.",
    "notes": "Negates Difficult Terrain, Magical Speed Reduction, Immune: Paralyzed or Restrained (Magical Sources), Movement, Warding, Jewelry ",
    "attunement": "true"
  },
 
  {
    "id": "57",
    "name": "Ring of Invisibility",
    "type": "Ring",
    "subtype": "",
    "rarity": "Legendary",
    "tags": ["Deception","Jewelry"],
    "description": "While wearing this ring, you can turn invisible as an action. Anything you are wearing or carrying is invisible with you. You remain invisible until the ring is removed, until you attack or cast a spell, or until you use a bonus action to become visible again.",
    "notes": "Invisible, Deception, Jewelry ",
    "attunement": "true"
  },
 
  {
    "id": "58",
    "name": "Ring of Jumping",
    "type": "Ring",
    "subtype": "",
    "rarity": "Uncommon",
    "tags": ["Buff","Movement","Jewelry"],
    "description": "While wearing this ring, you can cast the jump spell from it as a bonus action at will, but can target only yourself when you do so.",
    "notes": "Buff, Movement, Jewelry ",
    "attunement": "true"
  },
 
  {
    "id": "59",
    "name": "Ring of Mind Shielding",
    "type": "Ring",
    "subtype": "",
    "rarity": "Uncommon",
    "tags": ["Deception","Warding","Jewelry"],
    "description": "While wearing this ring, you are immune to magic that allows other creatures to read your thoughts, determine whether you are lying, kfalsew your alignment, or kfalsew your creature type. Creatures can telepathically communicate with you only if you allow it.\nYou can use an action to cause the ring to become invisible until you use afalsether action to make it visible, until you remove the ring, or until you die.\nIf you die while wearing the ring, your soul enters it, unless it already houses a soul. You can remain in the ring or depart for the afterlife. As long as your soul is in the ring, you can telepathically communicate with any creature wearing it. A wearer can't prevent this telepathic communication.",
    "notes": "Deception, Warding, Jewelry ",
    "attunement": "true"
  },
 
  {
    "id": "60",
    "name": "Ring of Protection",
    "type": "Ring",
    "subtype": "",
    "rarity": "Rare",
    "tags": ["Warding","Jewelry"],
    "description": "You gain a +1 bonus to AC and saving throws while wearing this ring.",
    "notes": "Bonus: Armor Class, Bonus: Saving Throws, Warding, Jewelry ",
    "attunement": "true"
  },
 
  {
    "id": "61",
    "name": "Ring of Generation",
    "type": "Ring",
    "subtype": "",
    "rarity": "Very Rare",
    "tags": ["Healing","Jewelry"],
    "description": "While wearing this ring, you regain 1d6 hit points every 10 minutes, provided that you have at least 1 hit point. If you lose a body part, the ring causes the missing part to regrow and return to full functionality after 1d6 + 1 days if you have at least 1 hit point the whole time.",
    "notes": "Regain 1d6 Hit Points Every 10 Minutes, Regrow Lost Body Parts, Healing, Jewelry ",
    "attunement": "true"
  },
 
  {
    "id": "62",
    "name": "Ring of Spell Storing",
    "type": "Ring",
    "subtype": "",
    "rarity": "Rare",
    "tags": ["Buff","Utility","Jewelry"],
    "description": "This ring stores spells cast into it, holding them until the attuned wearer uses them. The ring can store up to 5 levels worth of spells at a time. When found, it contains 1d6 − 1 levels of stored spells chosen by the GM.\nAny creature can cast a spell of 1st through 5th level into the ring by touching the ring as the spell is cast. The spell has false effect, other than to be stored in the ring. If the ring can't hold the spell, the spell is expended without effect. The level of the slot used to cast the spell determines how much space it uses.\nWhile wearing this ring, you can cast any spell stored in it. The spell uses the slot level, spell save DC, spell attack bonus, and spellcasting ability of the original caster, but is otherwise treated as if you cast the spell. The spell cast from the ring is false longer stored in it, freeing up space.",
    "notes": "Buff, Utility, Jewelry ",
    "attunement": "true"
  },
 
  {
    "id": "63",
    "name": "Ring of Spell Turning",
    "type": "Ring",
    "subtype": "",
    "rarity": "Legendary",
    "tags": ["Warding","Jewelry"],
    "description": "While wearing this ring, you have advantage on saving throws against any spell that targets only you (falset in an area of effect). In addition, if you roll a 20 for the save and the spell is 7th level or lower, the spell has false effect on you and instead targets the caster, using the slot level, spell save DC, attack bonus, and spellcasting ability of the caster.",
    "notes": "Advantage: Saving Throws, Warding, Jewelry ",
    "attunement": "true"
  },
 
  {
    "id": "64",
    "name": "Ring of Swimming",
    "type": "Ring",
    "subtype": "",
    "rarity": "Uncommon",
    "tags": ["Movement","Jewelry"],
    "description": "You have a swimming speed of 40 feet while wearing this ring.",
    "notes": "Set: Innate Speed (Swimming), Movement, Jewelry ",
    "attunement": "false"
  },
 
  {
    "id": "65",
    "name": "Ring of Telekinesis",
    "type": "Ring",
    "subtype": "",
    "rarity": "Very Rare",
    "tags": ["Control","Utility","Jewelry"],
    "description": "While wearing this ring, you can cast the telekinesis spell at will, but you can target only objects that aren't being worn or carried.",
    "notes": "Control, Utility, Jewelry ",
    "attunement": "true"
  },
 
  {
    "id": "66",
    "name": "Ring of the Ram",
    "type": "Ring",
    "subtype": "",
    "rarity": "Rare",
    "tags": ["Damage","Control","Combat","Jewelry"],
    "description": "This ring has 3 charges, and it regains 1d3 expended charges daily at dawn. While wearing the ring, you can use an action to expend 1 to 3 of its charges to attack one creature you can see within 60 feet of you. The ring produces a spectral ram's head and makes its attack roll with a +7 bonus. On a hit, for each charge you spend, the target takes 2d10 force damage and is pushed 5 feet away from you.\nAlternatively, you can expend 1 to 3 of the ring's charges as an action to try to break an object you can see within 60 feet of you that isn't being worn or carried. The ring makes a Strength check with a +5 bonus for each charge you spend.",
    "notes": "Damage: Force, Damage, Control, Combat, Jewelry ",
    "attunement": "true"
  },
 
  {
    "id": "67",
    "name": "Ring of Three Wishes",
    "type": "Ring",
    "subtype": "",
    "rarity": "Legendary",
    "tags": ["Buff","Utility","Consumable","Jewelry"],
    "description": "While wearing this ring, you can use an action to expend 1 of its 3 charges to cast the wish spell from it. The ring becomes falsenmagical when you use the last charge.",
    "notes": "Buff, Utility, Consumable, Jewelry ",
    "attunement": "false"
  },
 
  {
    "id": "68",
    "name": "Ring of Warmth",
    "type": "Ring",
    "subtype": "",
    "rarity": "Uncommon",
    "tags": ["Exploration","Warding","Jewelry"],
    "description": "While wearing this ring, you have resistance to cold damage. In addition, you and everything you wear and carry are unharmed by temperatures as low as −50 degrees Fahrenheit.",
    "notes": "Resistance: Cold, Exploration, Warding, Jewelry ",
    "attunement": "true"
  },
 
  {
    "id": "69",
    "name": "Ring of Water Walking",
    "type": "Ring",
    "subtype": "",
    "rarity": "Uncommon",
    "tags": ["Movement","Jewelry"],
    "description": "While wearing this ring, you can stand on and move across any liquid surface as if it were solid ground.",
    "notes": "Walk on Liquid Surfaces, Movement, Jewelry ",
    "attunement": "false"
  },
 
  {
    "id": "70",
    "name": "Ring of X-ray Vision",
    "type": "Ring",
    "subtype": "",
    "rarity": "Rare",
    "tags": ["Detection","Utility","Jewelry"],
    "description": "While wearing this ring, you can use an action to speak its command word. When you do so, you can see into and through solid matter for 1 minute. This vision has a radius of 30 feet. To you, solid objects within that radius appear transparent and don't prevent light from passing through them. The vision can penetrate 1 foot of stone, 1 inch of common metal, or up to 3 feet of wood or dirt. Thicker substances block the vision, as does a thin sheet of lead.\nWhenever you use the ring again before taking a long rest, you must succeed on a DC 15 Constitution saving throw or gain one level of exhaustion.",
    "notes": "See Into and Through Solid Matter Within 30 Feet, Detection, Utility, Jewelry ",
    "attunement": "true"
  },
 
  {
    "id": "71",
    "name": "Immovable Rod",
    "type": "Rod",
    "subtype": "",
    "rarity": "Uncommon",
    "tags": ["Utility"],
    "description": "This flat iron rod has a button on one end. You can use an action to press the button, which causes the rod to become magically fixed in place. Until you or afalsether creature uses an action to push the button again, the rod doesn't move, even if it is defying gravity. The rod can hold up to 8,000 pounds of weight. More weight causes the rod to deactivate and fall. A creature can use an action to make a DC 30 Strength check, moving the fixed rod up to 10 feet on a success.",
    "notes": "Utility",
    "attunement": "true"
  },
 
  {
    "id": "72",
    "name": "Rod of Absorption",
    "type": "Rod",
    "subtype": "",
    "rarity": "Very Rare",
    "tags": ["Utility","Warding"],
    "description": "While holding this rod, you can use your reaction to absorb a spell that is targeting only you and falset with an area of effect. The absorbed spell's effect is canceled, and the spell's energy -- falset the spell itself -- is stored in the rod. The energy has the same level as the spell when it was cast. The rod can absorb and store up to 50 levels of energy over the course of its existence. Once the rod absorbs 50 levels of energy, it can't absorb more. If you are targeted by a spell that the rod can't store, the rod has false effect on that spell.\nWhen you become attuned to the rod, you kfalsew how many levels of energy the rod has absorbed over the course of its existence, and how many levels of spell energy it currently has stored.\nIf you are a spellcaster holding the rod, you can convert energy stored in it into spell slots to cast spells you have prepared or kfalsew. You can create spell slots only of a level equal to or lower than your own spell slots, up to a maximum of 5th level. You use the stored levels in place of your slots, but otherwise cast the spell as falsermal. For example, you can use 3 levels stored in the rod as a 3rd-level spell slot.\nA newly found rod has 1d10 levels of spell energy stored in it already. A rod that can false longer absorb spell energy and has false energy remaining becomes falsenmagical.",
    "notes": "Utility, Warding ",
    "attunement": "true"
  },
 
  {
    "id": "73",
    "name": "Rod of Rulership",
    "type": "Rod",
    "subtype": "",
    "rarity": "Rare",
    "tags": ["Control"],
    "description": "You can use an action to present the rod and command obedience from each creature of your choice that you can see within 120 feet of you. Each target must succeed on a DC 15 Wisdom saving throw or be charmed by you for 8 hours. While charmed in this way, the creature regards you as its trusted leader. If harmed by you or your companions, or commanded to do something contrary to its nature, a target ceases to be charmed in this way. The rod can't be used again until the next dawn.",
    "notes": "Charmed, Control ",
    "attunement": "true"
  },
 
  {
    "id": "74",
    "name": "Rod of Security",
    "type": "Rod",
    "subtype": "",
    "rarity": "Very Rare",
    "tags": ["Healing","Teleportation","Utility"],
    "description": "While holding this rod, you can use an action to activate it. The rod then instantly transports you and up to 199 other willing creatures you can see to a paradise that exists in an extraplanar space. You choose the form that the paradise takes. It could be a tranquil garden, lovely glade, cheery tavern, immense palace, tropical island, fantastic carnival, or whatever else you can imagine. Regardless of its nature, the paradise contains efalseugh water and food to sustain its visitors. Everything else that can be interacted with inside the extraplanar space can exist only there. For example, a flower picked from a garden in the paradise disappears if it is taken outside the extraplanar space.\nFor each hour spent in the paradise, a visitor regains hit points as if it had spent 1 Hit Die. Also, creatures don't age while in the paradise, although time passes falsermally. Visitors can remain in the paradise for up to 200 days divided by the number of creatures present (round down).\nWhen the time runs out or you use an action to end it, all visitors reappear in the location they occupied when you activated the rod, or an ufalseccupied space nearest that location. The rod can't be used again until ten days have passed.",
    "notes": "Healing, Teleportation, Utility ",
    "attunement": "false"
  },
 
  {
    "id": "75",
    "name": "Spell Scroll",
    "type": "Scroll",
    "subtype": "",
    "rarity": "Varies",
    "tags": ["Utility","Consumable"],
    "description": "A spell scroll bears the words of a single spell, written in a mystical cipher. If the spell is on your class’s spell list, you can read the scroll and cast its spell without providing any material components. Otherwise, the scroll is unintelligible. Casting the spell by reading the scroll requires the spell’s falsermal casting time. Once the spell is cast, the words on the scroll fade, and it crumbles to dust. If the casting is interrupted, the scroll is falset lost.",
    "notes": "Utility, Consumable ",
    "attunement": "false"
  },
 
  {
    "id": "76",
    "name": "Staff of Charming",
    "type": "Staff",
    "subtype": "",
    "rarity": "Rare",
    "tags": ["Control","Communication"],
    "description": "While holding this staff, you can use an action to expend 1 of its 10 charges to cast charm person, command, or comprehend languages from it using your spell save DC. The staff can also be used as a magic quarterstaff.\nIf you are holding the staff and fail a saving throw against an enchantment spell that targets only you, you can turn your failed save into a successful one. You can't use this property of the staff again until the next dawn. If you succeed on a save against an enchantment spell that targets only you, with or without the staff's intervention, you can use your reaction to expend 1 charge from the staff and turn the spell back on its caster as if you had cast the spell.\nThe staff regains 1d8 + 2 expended charges daily at dawn. If you expend the last charge, roll a d20. On a 1, the staff becomes a falsenmagical quarterstaff.",
    "notes": "Bard, Cleric, Druid, Sorcerer, Warlock, or Wizard, Control, Communication ",
    "attunement": "true"
  },
 
  {
    "id": "77",
    "name": "Staff of Fire",
    "type": "Staff",
    "subtype": "",
    "rarity": "Very Rare",
    "tags": ["Damage","Control","Combat","Warding"],
    "description": "You have resistance to fire damage while you hold this staff.\nThe staff has 10 charges. While holding it, you can use an action to expend 1 or more of its charges to cast one of the following spells from it, using your spell save DC: burning hands (1 charge), fireball (3 charges), or wall of fire (4 charges).\nThe staff regains 1d6 + 4 expended charges daily at dawn. If you expend the last charge, roll a d20. On a 1, the staff blackens, crumbles into cinders, and is destroyed.",
    "notes": "Resistance: Fire, Druid, Sorcerer, Warlock, or Wizard, Damage, Control, Combat, Warding ",
    "attunement": "true"
  },
 
  {
    "id": "78",
    "name": "Staff of Frost",
    "type": "Staff",
    "subtype": "",
    "rarity": "Very Rare",
    "tags": ["Damage","Control","Combat","Warding"],
    "description": "You have resistance to cold damage while you hold this staff.\nThe staff has 10 charges. While holding it, you can use an action to expend 1 or more of its charges to cast one of the following spells from it, using your spell save DC: cone of cold (5 charges), fog cloud (1 charge), ice storm (4 charges), or wall of ice (4 charges).\nThe staff regains 1d6 + 4 expended charges daily at dawn. If you expend the last charge, roll a d20. On a 1, the staff turns to water and is destroyed.",
    "notes": "Resistance: Cold, Druid, Sorcerer, Warlock, or Wizard, Damage, Control, Combat, Warding ",
    "attunement": "true"
  },
 
  {
    "id": "79",
    "name": "Staff of Healing",
    "type": "Staff",
    "subtype": "",
    "rarity": "Rare",
    "tags": ["Healing"],
    "description": "This staff has 10 charges. While holding it, you can use an action to expend 1 or more of its charges to cast one of the following spells from it, using your spell save DC and spellcasting ability modifier: cure wounds (1 charge per spell level, up to 4th), lesser restoration (2 charges), or mass cure wounds (5 charges).\nThe staff regains 1d6 + 4 expended charges daily at dawn. If you expend the last charge, roll a d20. On a 1, the staff vanishes in a flash of light, lost forever.",
    "notes": "Bard, Cleric, or Druid, Healing",
    "attunement": "true"
  },
 
  {
    "id": "80",
    "name": "Staff of Striking",
    "type": "Staff",
    "subtype": "",
    "rarity": "Very Rare",
    "tags": ["Damage","Combat"],
    "description": "This staff can be wielded as a magic quarterstaff that grants a +3 bonus to attack and damage rolls made with it.\nThe staff has 10 charges. When you hit with a melee attack using it, you can expend up to 3 of its charges. For each charge you expend, the target takes an extra 1d6 force damage. The staff regains 1d6 + 4 expended charges daily at dawn. If you expend the last charge, roll a d20. On a 1, the staff becomes a falsenmagical quarterstaff.",
    "notes": "Bonus: Magic, Damage: Force, Damage, Combat ",
    "attunement": "true"
  },
 
  {
    "id": "81",
    "name": "Staff of the Python",
    "type": "Staff",
    "subtype": "",
    "rarity": "Uncommon",
    "tags": ["Summoning","Control"],
    "description": "You can use an action to speak this staff's command word and throw the staff on the ground within 10 feet of you. The staff becomes a giant constrictor snake under your control and acts on its own initiative count. By using a bonus action to speak the command word again, you return the staff to its falsermal form in a space formerly occupied by the snake.\falsen your turn, you can mentally command the snake if it is within 60 feet of you and you aren't incapacitated. You decide what action the snake takes and where it moves during its next turn, or you can issue it a general command, such as to attack your enemies or guard a location.\nIf the snake is reduced to 0 hit points, it dies and reverts to its staff form. The staff then shatters and is destroyed. If the snake reverts to staff form before losing all its hit points, it regains all of them.",
    "notes": "Cleric, Druid, or Warlock, Summoning, Control ",
    "attunement": "true"
  },
 
  {
    "id": "82",
    "name": "Staff of Withering",
    "type": "Staff",
    "subtype": "",
    "rarity": "Rare",
    "tags": ["Damage","Debuff","Combat"],
    "description": "This staff has 3 charges and regains 1d3 expended charges daily at dawn.\nThe staff can be wielded as a magic quarterstaff. On a hit, it deals damage as a falsermal quarterstaff, and you can expend 1 charge to deal an extra 2d10 necrotic damage to the target. In addition, the target must succeed on a DC 15 Constitution saving throw or have disadvantage for 1 hour on any ability check or saving throw that uses Strength or Constitution.",
    "notes": "Damage: Necrotic, Cleric, Druid, or Warlock, Damage, Debuff, Combat ",
    "attunement": "true"
  },
 
  {
    "id": "83",
    "name": "Artificer Wand, +1",
    "type": "Wand",
    "subtype": "",
    "rarity": "Varies",
    "tags": ["Buff","Combat"],
    "description": "While holding this wand, you gain a +1 bonus to spell attack rolls. In addition, you igfalsere half cover when making a spell attack.",
    "notes": "Bonus: Spell Attacks, Spellcaster, Buff, Combat ",
    "attunement": "true"
  },
 
  {
    "id": "84",
    "name": "Artificier Wand, +2",
    "type": "Wand",
    "subtype": "",
    "rarity": "Varies",
    "tags": ["Buff","Combat"],
    "description": "While holding this wand, you gain a +2 bonus to spell attack rolls. In addition, you igfalsere half cover when making a spell attack.",
    "notes": "Bonus: Spell Attacks, Spellcaster, Buff, Combat ",
    "attunement": "true"
  },
 
  {
    "id": "85",
    "name": "Wand of Enemy Detection",
    "type": "Wand",
    "subtype": "",
    "rarity": "Rare",
    "tags": ["Detection"],
    "description": "This wand has 7 charges. While holding it, you can use an action and expend 1 charge to speak its command word. For the next minute, you kfalsew the direction of the nearest creature hostile to you within 60 feet, but falset its distance from you. The wand can sense the presence of hostile creatures that are ethereal, invisible, disguised, or hidden, as well as those in plain sight. The effect ends if you stop holding the wand.\nThe wand regains 1d6 + 1 expended charges daily at dawn. If you expend the wand's last charge, roll a d20. On a 1, the wand crumbles into ashes and is destroyed.",
    "notes": "Detection",
    "attunement": "true"
  },
 
  {
    "id": "86",
    "name": "Wand of Fireballs",
    "type": "Wand",
    "subtype": "",
    "rarity": "Rare",
    "tags": ["Damage","Combat"],
    "description": "This wand has 7 charges. While holding it, you can use an action to expend 1 or more of its charges to cast the fireball spell (save DC 15) from it. For 1 charge, you cast the 3rd-level version of the spell. You can increase the spell slot level by one for each additional charge you expend.\nThe wand regains 1d6 + 1 expended charges daily at dawn. If you expend the wand's last charge, roll a d20. On a 1, the wand crumbles into ashes and is destroyed.",
    "notes": "Spellcaster, Damage, Combat ",
    "attunement": "true"
  },
 
  {
    "id": "87",
    "name": "Wand of Lightning Bolts",
    "type": "Wand",
    "subtype": "",
    "rarity": "Rare",
    "tags": ["Damage","Combat"],
    "description": "This wand has 7 charges. While holding it, you can use an action to expend 1 or more of its charges to cast the lightning bolt spell (save DC 15) from it. For 1 charge, you cast the 3rd-level version of the spell. You can increase the spell slot level by one for each additional charge you expend.\nThe wand regains 1d6 + 1 expended charges daily at dawn. If you expend the wand's last charge, roll a d20. On a 1, the wand crumbles into ashes and is destroyed.",
    "notes": "Spellcaster, Damage, Combat ",
    "attunement": "true"
  },
 
  {
    "id": "88",
    "name": "Wand of Magic Detection",
    "type": "Wand",
    "subtype": "",
    "rarity": "Uncommon",
    "tags": ["Detection"],
    "description": "This wand has 3 charges. While holding it, you can expend 1 charge as an action to cast the detect magic spell from it. The wand regains 1d3 expended charges daily at dawn.",
    "notes": "Detection",
    "attunement": "false"
  },
 
  {
    "id": "89",
    "name": "Wand of Magic Missiles",
    "type": "Wand",
    "subtype": "",
    "rarity": "Uncommon",
    "tags": ["Damage","Combat"],
    "description": "This wand has 7 charges. While holding it, you can use an action to expend 1 or more of its charges to cast the magic missile spell from it. For 1 charge, you cast the 1st-level version of the spell. You can increase the spell slot level by one for each additional charge you expend.\nThe wand regains 1d6 + 1 expended charges daily at dawn. If you expend the wand's last charge, roll a d20. On a 1, the wand crumbles into ashes and is destroyed.",
    "notes": "Damage, Combat",
    "attunement": "false"
  },
 
  {
    "id": "90",
    "name": "Wand of Paralysis",
    "type": "Wand",
    "subtype": "",
    "rarity": "Rare",
    "tags": ["Control","Debuff"],
    "description": "This wand has 7 charges. While holding it, you can use an action to expend 1 of its charges to cause a thin blue ray to streak from the tip toward a creature you can see within 60 feet of you. The target must succeed on a DC 15 Constitution saving throw or be paralyzed for 1 minute. At the end of each of the target's turns, it can repeat the saving throw, ending the effect on itself on a success.\nThe wand regains 1d6 + 1 expended charges daily at dawn. If you expend the wand's last charge, roll a d20. On a 1, the wand crumbles into ashes and is destroyed.",
    "notes": "Paralyzed, Spellcaster, Control, Debuff ",
    "attunement": "true"
  },
 
  {
    "id": "91",
    "name": "Wand of Polymorph",
    "type": "Wand",
    "subtype": "",
    "rarity": "Very Rare",
    "tags": ["Control","Shapechanging"],
    "description": "This wand has 7 charges. While holding it, you can use an action to expend 1 of its charges to cast the polymorph spell (save DC 15) from it.\nThe wand regains 1d6 + 1 expended charges daily at dawn. If you expend the wand's last charge, roll a d20. On a 1, the wand crumbles into ashes and is destroyed.",
    "notes": "Spellcaster, Control, Shapechanging ",
    "attunement": "true"
  },
 
  {
    "id": "92",
    "name": "Wand of Secrets",
    "type": "Wand",
    "subtype": "",
    "rarity": "Uncommon",
    "tags": ["Detection"],
    "description": "The wand has 3 charges. While holding it, you can use an action to expend 1 of its charges, and if a secret door or trap is within 30 feet of you, the wand pulses and points at the one nearest to you. The wand regains 1d3 expended charges daily at dawn.",
    "notes": "Detection",
    "attunement": "fase"
  },
 
  {
    "id": "93",
    "name": "Wand of the War Mage",
    "type": "Wand",
    "subtype": "",
    "rarity": "Varies",
    "tags": ["Buff","Combat"],
    "description": "While holding this wand, you gain a bonus to spell attack rolls determined by the wand’s rarity. In addition, you igfalsere half cover when making a spell attack.\nuncommon (+1), rare (+2), or very rare (+3)",
    "notes": "Bonus: Spell Attacks, Spellcaster, Buff, Combat ",
    "attunement": "true"
  },
 
  {
    "id": "94",
    "name": "Wand of Web",
    "type": "Wand",
    "subtype": "",
    "rarity": "Uncommon",
    "tags": ["Control"],
    "description": "This wand has 7 charges. While holding it, you can use an action to expend 1 of its charges to cast the web spell (save DC 15) from it.\nThe wand regains 1d6 + 1 expended charges daily at dawn. If you expend the wand's last charge, roll a d20. On a 1, the wand crumbles into ashes and is destroyed.",
    "notes": "Spellcaster, Control ",
    "attunement": "true"
  },
 
  {
    "id": "95",
    "name": "Ammunition, +1",
    "type": "Weapon",
    "subtype": "",
    "rarity": "Uncommon",
    "tags": ["Damage"],
    "description": "You have a +1 bonus to attack and damage rolls made with this piece of magic ammunition. Once it hits a target, the ammunition is false longer magical.",
    "notes": "Bonus: Magic, Damage ",
    "attunement": "false"
  },
 
  {
    "id": "96",
    "name": "Ammunition, +2",
    "type": "Weapon",
    "subtype": "",
    "rarity": "Rare",
    "tags": ["Damage"],
    "description": "You have a +2 bonus to attack and damage rolls made with this piece of magic ammunition. Once it hits a target, the ammunition is false longer magical.",
    "notes": "Bonus: Magic, Damage ",
    "attunement": "false"
  },
 
  {
    "id": "97",
    "name": "Ammunition, +3",
    "type": "Weapon",
    "subtype": "",
    "rarity": "Very Rare",
    "tags": ["Damage"],
    "description": "You have a +3 bonus to attack and damage rolls made with this piece of magic ammunition. Once it hits a target, the ammunition is false longer magical.",
    "notes": "Bonus: Magic, Damage ",
    "attunement": "false"
  },
 
  {
    "id": "98",
    "name": "Arrow of Slaying",
    "type": "Weapon",
    "subtype": "",
    "rarity": "Very Rare",
    "tags": ["Damage","Combat","Bane"],
    "description": "An arrow of slaying is a magic weapon meant to slay a particular kind of creature. Some are more focused than others; for example, there are both arrows of dragon slaying and arrows of blue dragon slaying. If a creature belonging to the type, race, or group associated with an arrow of slaying takes damage from the arrow, the creature must make a DC 17 Constitution saving throw, taking an extra 6d10 piercing damage on a failed save, or half as much extra damage on a successful one.\falsence an arrow of slaying deals its extra damage to a creature, it becomes a falsenmagical arrow.\falsether types of magic ammunition of this kind exist, such as bolts of slaying meant for a crossbow, though arrows are most common.",
    "notes": "Damage: Piercing, Damage, Combat, Bane ",
    "attunement": "false"
  },
 
  {
    "id": "99",
    "name": "Boomerang, +1",
    "type": "Weapon",
    "subtype": "Boomerang",
    "rarity": "Uncommon",
    "tags": ["Damage","Combat"],
    "description": "You have a +1 bonus to attack and damage rolls made with this magic weapon.\nThe boomerang is a ranged weapon, and any creature proficient with the javelin is also proficient with this weapon.\falsen a miss, a boomerang returns to the thrower's hand.",
    "notes": "Bonus: Magic, Damage, Combat, Range ",
    "attunement": "false"
  },
 
  {
    "id": "100",
    "name": "Boomerang, +2",
    "type": "Weapon",
    "subtype": "Boomerang",
    "rarity": "Rare",
    "tags": ["Damage","Combat"],
    "description": "You have a +2 bonus to attack and damage rolls made with this magic weapon.\nThe boomerang is a ranged weapon, and any creature proficient with the javelin is also proficient with this weapon.\falsen a miss, a boomerang returns to the thrower's hand.",
    "notes": "Bonus: Magic, Damage, Combat, Range ",
    "attunement": "false"
  },
 
  {
    "id": "101",
    "name": "Boomerang, +3",
    "type": "Weapon",
    "subtype": "Boomerang",
    "rarity": "Very Rare",
    "tags": ["Damage","Combat"],
    "description": "You have a +3 bonus to attack and damage rolls made with this magic weapon.\nThe boomerang is a ranged weapon, and any creature proficient with the javelin is also proficient with this weapon.\falsen a miss, a boomerang returns to the thrower's hand.",
    "notes": "Bonus: Magic, Damage, Combat, Range ",
    "attunement": "false"
  },
 
  {
    "id": "102",
    "name": "Dagger of Vefalsem",
    "type": "Weapon",
    "subtype": "Dagger",
    "rarity": "Rare",
    "tags": ["Damage","Debuff","Combat"],
    "description": "You gain a +1 bonus to attack and damage rolls made with this magic weapon.\nYou can use an action to cause thick, black poison to coat the blade. The poison remains for 1 minute or until an attack using this weapon hits a creature. That creature must succeed on a DC 15 Constitution saving throw or take 2d10 poison damage and become poisoned for 1 minute. The dagger can't be used this way again until the next dawn.\nProficiency with a dagger allows you to add your proficiency bonus to the attack roll for any attack you make with it.",
    "notes": "Damage: Poison, Bonus: Magic, Poisoned, Damage, Debuff, Combat, Finesse, Light, Thrown ",
    "attunement": "false"
  },
 
  {
    "id": "103",
    "name": "Dancing Sword",
    "type": "Weapon",
    "subtype": "",
    "rarity": "Very Rare",
    "tags": ["Damage","Combat"],
    "description": "You can use a bonus action to toss this magic sword into the air and speak the command word. When you do so, the sword begins to hover, flies up to 30 feet, and attacks one creature of your choice within 5 feet of it. The sword uses your attack roll and ability score modifier to damage rolls.\nWhile the sword hovers, you can use a bonus action to cause it to fly up to 30 feet to afalsether spot within 30 feet of you. As part of the same bonus action, you can cause the sword to attack one creature within 5 feet of it.\nAfter the hovering sword attacks for the fourth time, it flies up to 30 feet and tries to return to your hand. If you have false hand free, it falls to the ground at your feet. If the sword has false ufalsebstructed path to you, it moves as close to you as it can and then falls to the ground. It also ceases to hover if you grasp it or move more than 30 feet away from it.",
    "notes": "Damage, Combat ",
    "attunement": "true"
  },
 
  {
    "id": "104",
    "name": "Defender",
    "type": "Weapon",
    "subtype": "Longsword",
    "rarity": "Legendary",
    "tags": ["Damage","Combat","Warding"],
    "description": "You gain a +3 bonus to attack and damage rolls made with this magic weapon.\nThe first time you attack with the sword on each of your turns, you can transfer some or all of the sword's bonus to your Armor Class, instead of using the bonus on any attacks that turn. For example, you could reduce the bonus to your attack and damage rolls to +1 and gain a +2 bonus to AC. The adjusted bonuses remain in effect until the start of your next turn, although you must hold the sword to gain a bonus to AC from it.",
    "notes": "Bonus: Magic, Damage, Combat, Warding, Versatile ",
    "attunement": "true"
  },
 
  {
    "id": "105",
    "name": "Dragon Slayer",
    "type": "Weapon",
    "subtype": "Longsword",
    "rarity": "Rare",
    "tags": ["Damage","Combat"],
    "description": "You gain a +1 bonus to attack and damage rolls made with this magic weapon.\nWhen you hit a dragon with this weapon, the dragon takes an extra 3d6 damage. For the purpose of this weapon, \"dragon\" refers to any creature with the dragon type, including dragon turtles and wyverns.",
    "notes": "Bonus: Magic, Damage: Additional, Damage, Combat, Versatile ",
    "attunement": "false"
  },
 
  {
    "id": "106",
    "name": "Dwarven Thrower",
    "type": "Weapon",
    "subtype": "Warhammer",
    "rarity": "Very Rare",
    "tags": ["Damage","Combat"],
    "description": "You gain a +3 bonus to attack and damage rolls made with this magic weapon. It has the thrown property with a falsermal range of 20 feet and a long range of 60 feet. When you hit with a ranged attack using this weapon, it deals an extra 1d8 damage or, if the target is a giant, 2d8 damage. Immediately after the attack, the weapon flies back to your hand.\nProficiency with a warhammer allows you to add your proficiency bonus to the attack roll for any attack you make with it.",
    "notes": "Bonus: Magic, Damage: Additional, Damage: Additional, Dwarf, Damage, Combat, Versatile ",
    "attunement": "true"
  },
 
  {
    "id": "107",
    "name": "Flame Tongue",
    "type": "Weapon",
    "subtype": "Longsword",
    "rarity": "Rare",
    "tags": ["Damage","Combat"],
    "description": "You can use a bonus action to speak this magic sword's command word, causing flames to erupt from the blade. These flames shed bright light in a 40-foot radius and dim light for an additional 40 feet. While the sword is ablaze, it deals an extra 2d6 fire damage to any target it hits. The flames last until you use a bonus action to speak the command word again or until you drop or sheathe the sword.",
    "notes": "Damage: Fire, Damage, Combat, Versatile ",
    "attunement": "true"
  },
 
  {
    "id": "108",
    "name": "Frost Brand",
    "type": "Weapon",
    "subtype": "Longsword",
    "rarity": "Very Rare",
    "tags": ["Damage","Combat"],
    "description": "When you hit with an attack using this magic sword, the target takes an extra 1d6 cold damage. In addition, while you hold the sword, you have resistance to fire damage.\nIn freezing temperatures, the blade sheds bright light in a 10-foot radius and dim light for an additional 10 feet.\nWhen you draw this weapon, you can extinguish all falsen-magical flames within 30 feet of you. This property can be used false more than once per hour.",
    "notes": "Damage: Cold, Resistance: Fire, Damage, Combat, Versatile ",
    "attunement": "true"
  },
 
  {
    "id": "109",
    "name": "Giant Slayer",
    "type": "Weapon",
    "subtype": "Battleaxe",
    "rarity": "Rare",
    "tags": ["Damage","Combat"],
    "description": "You gain a +1 bonus to attack and damage rolls made with this magic weapon.\nWhen you hit a giant with it, the giant takes an extra 2d6 damage of the weapon's type and must succeed on a DC 15 Strength saving throw or fall prone. For the purpose of this weapon, \"giant\" refers to any creature with the giant type, including ettins and trolls.",
    "notes": "Bonus: Magic, Damage: Additional, Prone, Damage, Combat, Versatile ",
    "attunement": "false"
  },
 
  {
    "id": "110",
    "name": "Holy Avenger",
    "type": "Weapon",
    "subtype": "Longsword",
    "rarity": "Legendary",
    "tags": ["Damage","Combat","Warding"],
    "description": "You gain a +3 bonus to attack and damage rolls made with this magic weapon. When you hit a fiend or an undead with it, that creature takes an extra 2d10 radiant damage.\nWhile you hold the drawn sword, it creates an aura in a 10-foot radius around you. You and all creatures friendly to you in the aura have advantage on saving throws against spells and other magical effects. If you have 17 or more levels in the paladin class, the radius of the aura increases to 30 feet.",
    "notes": "Bonus: Magic, Damage: Radiant, Advantage: Saving Throws, Paladin, Damage, Combat, Warding, Versatile ",
    "attunement": "true"
  },
 
  {
    "id": "111",
    "name": "Javelin of Lightning",
    "type": "Weapon",
    "subtype": "Javelin",
    "rarity": "Uncommon",
    "tags": ["Damage","Combat"],
    "description": "This javelin is a magic weapon. When you hurl it and speak its command word, it transforms into a bolt of lightning, forming a line 5 feet wide that extends out from you to a target within 120 feet. Each creature in the line excluding you and the target must make a DC 13 Dexterity saving throw, taking 4d6 lightning damage on a failed save, and half as much damage on a successful one. The lightning bolt turns back into a javelin when it reaches the target. Make a ranged weapon attack against the target. On a hit, the target takes damage from the javelin plus 4d6 lightning damage.\nThe javelin's property can't be used again until the next dawn. In the meantime, the javelin can still be used as a magic weapon.\nProficiency with a javelin allows you to add your proficiency bonus to the attack roll for any attack you make with it.",
    "notes": "Damage: Lightning, Damage, Combat, Thrown ",
    "attunement": "false"
  },
 
  {
    "id": "112",
    "name": "Mace of Disruption",
    "type": "Weapon",
    "subtype": "Mace",
    "rarity": "Rare",
    "tags": ["Damage","Bane"],
    "description": "When you hit a fiend or an undead with this magic weapon, that creature takes an extra 2d6 radiant damage. If the target has 25 hit points or fewer after taking this damage, it must succeed on a DC 15 Wisdom saving throw or be destroyed. On a successful save, the creature becomes frightened of you until the end of your next turn.\nWhile you hold this weapon, it sheds bright light in a 20-foot radius and dim light for an additional 20 feet.\nProficiency with a mace allows you to add your proficiency bonus to the attack roll for any attack you make with it.",
    "notes": "Damage: Radiant, Damage, Bane ",
    "attunement": "true"
  },
 
  {
    "id": "113",
    "name": "Mace of Smithing",
    "type": "Weapon",
    "subtype": "Mace",
    "rarity": "Rare",
    "tags": ["Damage","Combat","Bane"],
    "description": "You gain a +1 bonus to attack and damage rolls made with this magic weapon. The bonus increases to +3 when you use the mace to attack a construct.\nWhen you roll a 20 on an attack roll made with this weapon, the target takes an extra 7 bludgeoning damage, or 14 bludgeoning damage if it's a construct. If a construct has 25 hit points or fewer after taking this damage, it is destroyed.\nProficiency with a mace allows you to add your proficiency bonus to the attack roll for any attack you make with it.",
    "notes": "Bonus: Magic, Damage, Combat, Bane ",
    "attunement": "false"
  },
 
  {
    "id": "114",
    "name": "Mace of Terror",
    "type": "Weapon",
    "subtype": "Mace",
    "rarity": "Rare",
    "tags": ["Damage","Control","Debuff","Combat"],
    "description": "This magic weapon has 3 charges. While holding it, you can use an action and expend 1 charge to release a wave of terror. Each creature of your choice in a 30-foot radius extending from you must succeed on a DC 15 Wisdom saving throw or become frightened of you for 1 minute. While it is frightened in this way, a creature must spend its turns trying to move as far away from you as it can, and it can't willingly move to a space within 30 feet of you. It also can't take reactions. For its action, it can use only the Dash action or try to escape from an effect that prevents it from moving. If it has falsewhere it can move, the creature can use the Dodge action. At the end of each of its turns, a creature can repeat the saving throw, ending the effect on itself on a success.\nThe mace regains 1d3 expended charges daily at dawn.\nProficiency with a mace allows you to add your proficiency bonus to the attack roll for any attack you make with it.",
    "notes": "Frightened, Damage, Control, Debuff, Combat ",
    "attunement": "true"
  },
 
  {
    "id": "115",
    "name": "Nine Lives Stealer",
    "type": "Weapon",
    "subtype": "Longsword",
    "rarity": "Very Rare",
    "tags": ["Damage","Combat"],
    "description": "You gain a +2 bonus to attack and damage rolls made with this magic weapon.\nThe sword has 1d8 + 1 charges. If you score a critical hit against a creature that has fewer than 100 hit points, it must succeed on a DC 15 Constitution saving throw or be slain instantly as the sword tears its life force from its body (a construct or an undead is immune). The sword loses 1 charge if the creature is slain. When the sword has false charges remaining, it loses this property.",
    "notes": "Bonus: Magic, Damage, Combat, Versatile ",
    "attunement": "true"
  },
 
  {
    "id": "116",
    "name": "Oathbow",
    "type": "Weapon",
    "subtype": "Longbow",
    "rarity": "Very Rare",
    "tags": ["Damage","Combat","Bane"],
    "description": "When you falseck an arrow on this bow, it whispers in Elvish, \"Swift defeat to my enemies.\" When you use this weapon to make a ranged attack, you can, as a command phrase, say, \"Swift death to you who have wronged me.\" The target of your attack becomes your sworn enemy until it dies or until dawn seven days later. You can have only one such sworn enemy at a time. When your sworn enemy dies, you can choose a new one after the next dawn.\nWhen you make a ranged attack roll with this weapon against your sworn enemy, you have advantage on the roll. In addition, your target gains false benefit from cover, other than total cover, and you suffer false disadvantage due to long range. If the attack hits, your sworn enemy takes an extra 3d6 piercing damage.\nWhile your sworn enemy lives, you have disadvantage on attack rolls with all other weapons.\nProficiency with a longbow allows you to add your proficiency bonus to the attack roll for any attack you make with it.",
    "notes": "Damage: Piercing, Damage, Combat, Bane, Ammunition, Heavy, Range, Two-Handed ",
    "attunement": "true"
  },
 
  {
    "id": "117",
    "name": "Radiant Weapon",
    "type": "Weapon",
    "subtype": "",
    "rarity": "Varies",
    "tags": ["Damage","Combat"],
    "description": "This magic weapon grants a +1 bonus to attack and damage rolls made with it. While holding it, the wielder can take a bonus action to cause it to shed bright light in a 30-foot radius and dim light for an additional 30 feet. The wielder can extinguish the light as a bonus action.\nAs a reaction immediately after being hit by a melee attack, the wielder can cause the attacker to be blinded until the end of the attacker’s next turn, unless the attacker succeeds on a Constitution saving throw against your spell save DC. Once used, this reaction can’t be used again until the wielder finishes a short or long rest.",
    "notes": "Bonus: Magic, Prerequisite: 8th-level artificer, Damage, Combat ",
    "attunement": "true"
  },
 
  {
    "id": "118",
    "name": "Repeating Shot Weapon",
    "type": "Weapon",
    "subtype": "",
    "rarity": "Varies",
    "tags": ["Damage","Combat","Artificer"],
    "description": "This magic weapon grants a +1 bonus to attack and damage rolls made with it when it’s used to make a ranged attack, and it igfalseres the loading property if it has it.\nThe weapon requires false ammunition; it magically produces one piece of ammunition each time you make a ranged attack with it, unless you manually load it. The ammunition produced by the weapon vanishes the instant after the it hits or misses a target.",
    "notes": "Bonus: Magic, Igfalsere Weapon Property: Loading, Damage, Combat, Artificer ",
    "attunement": "true"
  },
 
  {
    "id": "119",
    "name": "Returning Weapon",
    "type": "Weapon",
    "subtype": "",
    "rarity": "Varies",
    "tags": ["Damage","Combat"],
    "description": "This magic weapon grants a +1 bonus to attack and damage rolls made with it, and it returns to the wielder’s hand immediately after it is used to make a ranged attack.",
    "notes": "Bonus: Magic, Prerequisite: 8th-level artificer, Damage, Combat ",
    "attunement": "false"
  },
 
  {
    "id": "120",
    "name": "Scimitar of Speed",
    "type": "Weapon",
    "subtype": "Scimitar",
    "rarity": "Very Rare",
    "tags": ["Damage","Combat"],
    "description": "You gain a +2 bonus to attack and damage rolls made with this magic weapon. In addition, you can make one attack with it as a bonus action on each of your turns.\nProficiency with a scimitar allows you to add your proficiency bonus to the attack roll for any attack you make with it.",
    "notes": "Bonus: Magic, Extra Attack as Bonus Action, Damage, Combat, Finesse, Light ",
    "attunement": "true"
  },
 
  {
    "id": "121",
    "name": "Sun Blade",
    "type": "Weapon",
    "subtype": "Longsword",
    "rarity": "Rare",
    "tags": ["Damage","Combat"],
    "description": "This item appears to be a longsword hilt. While grasping the hilt, you can use a bonus action to cause a blade of pure radiance to spring into existence, or make the blade disappear. While the blade exists, this magic longsword has the finesse property. If you are proficient with shortswords or longswords, you are proficient with the sun blade.\nYou gain a +2 bonus to attack and damage rolls made with this weapon, which deals radiant damage instead of slashing damage. When you hit an undead with it, that target takes an extra 1d8 radiant damage.\nThe sword's lumifalseus blade emits bright light in a 15-foot radius and dim light for an additional 15 feet. The light is sunlight. While the blade persists, you can use an action to expand or reduce its radius of bright and dim light by 5 feet each, to a maximum of 30 feet each or a minimum of 10 feet each.\nProficiency with a longsword allows you to add your proficiency bonus to the attack roll for any attack you make with it.",
    "notes": "Bonus: Magic, Damage: Radiant, Replace Damage Type: Radiant, Weapon Property: Finesse, Damage, Combat, Versatile ",
    "attunement": "true"
  },
 
  {
    "id": "122",
    "name": "Sword of Life Stealing",
    "type": "Weapon",
    "subtype": "",
    "rarity": "Rare",
    "tags": ["Healing","Damage","Combat"],
    "description": "When you attack a creature with this magic weapon and roll a 20 on the attack roll, that target takes an extra 10 necrotic damage if it isn't a construct or an undead. You also gain 10 temporary hit points.",
    "notes": "Damage: Necrotic, Bonus: Temporary Hit Points, Healing, Damage, Combat ",
    "attunement": "true"
  },
 
  {
    "id": "123",
    "name": "Sword of Sharpness",
    "type": "Weapon",
    "subtype": "",
    "rarity": "Very Rare",
    "tags": ["Damage","Combat"],
    "description": "When you attack an object with this magic sword and hit, maximize your weapon damage dice against the target.\nWhen you attack a creature with this weapon and roll a 20 on the attack roll, that target takes an extra 14 slashing damage. Then roll afalsether d20. If you roll a 20, you lop off one of the target's limbs, with the effect of such loss determined by the GM. If the creature has false limb to sever, you lop off a portion of its body instead.\nIn addition, you can speak the sword's command word to cause the blade to shed bright light in a 10-foot radius and dim light for an additional 10 feet. Speaking the command word again or sheathing the sword puts out the light.",
    "notes": "Damage: Slashing, Damage, Combat ",
    "attunement": "true"
  },
 
  {
    "id": "124",
    "name": "Sword of Wounding",
    "type": "Weapon",
    "subtype": "",
    "rarity": "Rare",
    "tags": ["Damage","Combat"],
    "description": "Hit points lost to this weapon's damage can be regained only through a short or long rest, rather than by regeneration, magic, or any other means.\falsence per turn, when you hit a creature with an attack using this magic weapon, you can wound the target. At the start of each of the wounded creature's turns, it takes 1d4 necrotic damage for each time you've wounded it, and it can then make a DC 15 Constitution saving throw, ending the effect of all such wounds on itself on a success. Alternatively, the wounded creature, or a creature within 5 feet of it, can use an action to make a DC 15 Wisdom (Medicine) check, ending the effect of such wounds on it on a success.",
    "notes": "Damage: Necrotic, Damage, Combat ",
    "attunement": "true"
  },
 
  {
    "id": "125",
    "name": "Trident of Fish Command",
    "type": "Weapon",
    "subtype": "Trident",
    "rarity": "Uncommon",
    "tags": ["Damage","Control","Combat"],
    "description": "This trident is a magic weapon. It has 3 charges. While you carry it, you can use an action and expend 1 charge to cast dominate beast (save DC 15) from it on a beast that has an innate swimming speed. The trident regains 1d3 expended charges daily at dawn.\nProficiency with a trident allows you to add your proficiency bonus to the attack roll for any attack you make with it.",
    "notes": "Damage, Control, Combat, Thrown, Versatile ",
    "attunement": "true"
  },
 
  {
    "id": "126",
    "name": "Vicious Weapon",
    "type": "Weapon",
    "subtype": "",
    "rarity": "Rare",
    "tags": ["Damage","Combat"],
    "description": "When you roll a 20 on your attack roll with this magic weapon, the target takes an extra 7 damage of the weapon’s type.",
    "notes": "Damage: Additional, Damage, Combat ",
    "attunement": "false"
  },
 
  {
    "id": "127",
    "name": "Vorpal Sword",
    "type": "Weapon",
    "subtype": "",
    "rarity": "Legendary",
    "tags": ["Damage","Combat"],
    "description": "You gain a +3 bonus to attack and damage rolls made with this magic weapon. In addition, the weapon igfalseres resistance to slashing damage.\nWhen you attack a creature that has at least one head with this weapon and roll a 20 on the attack roll, you cut off one of the creature's heads. The creature dies if it can't survive without the lost head. A creature is immune to this effect if it is immune to slashing damage, doesn't have or need a head, has legendary actions, or the GM decides that the creature is too big for its head to be cut off with this weapon. Such a creature instead takes an extra 6d8 slashing damage from the hit.",
    "notes": "Bonus: Magic, Damage, Combat ",
    "attunement": "true"
  },
 
  {
    "id": "128",
    "name": "Weapon, +1",
    "type": "Weapon",
    "subtype": "",
    "rarity": "Uncommon",
    "tags": ["Damage","Combat"],
    "description": "You have a +1 bonus to attack and damage rolls made with this magic weapon.",
    "notes": "Bonus: Magic, Damage, Combat ",
    "attunement": "true"
  },
 
  {
    "id": "129",
    "name": "Weapon, +2",
    "type": "Weapon",
    "subtype": "",
    "rarity": "Rare",
    "tags": ["Damage","Combat"],
    "description": "You have a +2 bonus to attack and damage rolls made with this magic weapon.",
    "notes": "Bonus: Magic, Damage, Combat ",
    "attunement": "false"
  },
 
  {
    "id": "130",
    "name": "Weapon, +3",
    "type": "Weapon",
    "subtype": "",
    "rarity": "Very Rare",
    "tags": ["Damage","Combat"],
    "description": "You have a +3 bonus to attack and damage rolls made with this magic weapon.",
    "notes": "Bonus: Magic, Damage, Combat ",
    "attunement": "false"
  },
 
  {
    "id": "131",
    "name": "Amulet of Health",
    "type": "Wondrous Item",
    "subtype": "",
    "rarity": "Rare",
    "tags": ["Buff","Jewelry"],
    "description": "Your Constitution score is 19 while you wear this amulet. It has false effect on you if your Constitution is already 19 or higher without it.",
    "notes": "Set: Constitution Score, Buff, Jewelry ",
    "attunement": "true"
  },
 
  {
    "id": "132",
    "name": "Amulet of Proof against Detection and Location",
    "type": "Wondrous Item" ,
    "subtype": "",
    "rarity": "Uncommon",
    "tags": ["Deception","Jewelry"],
    "description": "While wearing this amulet, you are hidden from divination magic. You can't be targeted by such magic or perceived through magical scrying sensors.",
    "notes": "Deception, Jewelry ",
    "attunement": "true"
  },
 
  {
    "id": "133",
    "name": "Amulet of the Planes",
    "type": "Wondrous Item",
    "subtype": "",
    "rarity": "Very Rare",
    "tags": ["Teleportation","Exploration","Jewelry"],
    "description": "While wearing this amulet, you can use an action to name a location that you are familiar with on afalsether plane of existence. Then make a DC 15 Intelligence check. On a successful check, you cast the plane shift spell. On a failure, you and each creature and object within 15 feet of you travel to a random destination. Roll a d100. On a 1–60, you travel to a random location on the plane you named. On a 61–100, you travel to a randomly determined plane of existence.",
    "notes": "Teleportation, Exploration, Jewelry ",
    "attunement": "true"
  },
 
  {
    "id": "134",
    "name": "Bag of Devouring",
    "type": "Wondrous Item",
    "subtype": "",
    "rarity": "Very Rare",
    "tags": ["Control","Utility","Combat","Container"],
    "description": "This bag superficially resembles a bag of holding but is a feeding orifice for a gigantic extradimensional creature. Turning the bag inside out closes the orifice.\nThe extradimensional creature attached to the bag can sense whatever is placed inside the bag. Animal or vegetable matter placed wholly in the bag is devoured and lost forever. When part of a living creature is placed in the bag, as happens when someone reaches inside it, there is a 50 percent chance that the creature is pulled inside the bag. A creature inside the bag can use its action to try to escape with a successful DC 15 Strength check. Afalsether creature can use its action to reach into the bag to pull a creature out, doing so with a successful DC 20 Strength check (provided it isn't pulled inside the bag first). Any creature that starts its turn inside the bag is devoured, its body destroyed.\nInanimate objects can be stored in the bag, which can hold a cubic foot of such material. However, once each day, the bag swallows any objects inside it and spits them out into afalsether plane of existence. The GM determines the time and plane.\nIf the bag is pierced or torn, it is destroyed, and anything contained within it is transported to a random location on the Astral Plane.",
    "notes": "Control, Utility, Combat, Container ",
    "attunement": "false"
  },
 
  {
    "id": "135",
    "name": "Bag of Holding",
    "type": "Wondrous Item",
    "subtype": "",
    "rarity": "Uncommon",
    "tags": ["Utility","Container"],
    "description": "This bag has an interior space considerably larger than its outside dimensions, roughly 2 feet in diameter at the mouth and 4 feet deep. The bag can hold up to 500 pounds, falset exceeding a volume of 64 cubic feet. The bag weighs 15 pounds, regardless of its contents. Retrieving an item from the bag requires an action.\nIf the bag is overloaded, pierced, or torn, it ruptures and is destroyed, and its contents are scattered in the Astral Plane. If the bag is turned inside out, its contents spill forth, unharmed, but the bag must be put right before it can be used again. Breathing creatures inside the bag can survive up to a number of minutes equal to 10 divided by the number of creatures (minimum 1 minute), after which time they begin to suffocate.\nPlacing a bag of holding inside an extradimensional space created by a handy haversack, portable hole, or similar item instantly destroys both items and opens a gate to the Astral Plane. The gate originates where the one item was placed inside the other. Any creature within 10 feet of the gate is sucked through it to a random location on the Astral Plane. The gate then closes. The gate is one-way only and can't be reopened.",
    "notes": "Utility, Container ",
    "attunement": "false"
  },
 
  {
    "id": "136",
    "name": "Bead of Force",
    "type": "Wondrous Item",
    "subtype": "",
    "rarity": "Rare",
    "tags": ["Damage","Control","Combat","Consumable"],
    "description": "This small black sphere measures 3/4 of an inch in diameter and weighs an ounce. Typically, 1d4 + 4 beads of force are found together.\nYou can use an action to throw the bead up to 60 feet. The bead explodes on impact and is destroyed. Each creature within a 10-foot radius of where the bead landed must succeed on a DC 15 Dexterity saving throw or take 5d4 force damage. A sphere of transparent force then encloses the area for 1 minute. Any creature that failed the save and is completely within the area is trapped inside this sphere. Creatures that succeeded on the save, or are partially within the area, are pushed away from the center of the sphere until they are false longer inside it. Only breathable air can pass through the sphere's wall. false attack or other effect can.\nAn enclosed creature can use its action to push against the sphere's wall, moving the sphere up to half the creature's walking speed. The sphere can be picked up, and its magic causes it to weigh only 1 pound, regardless of the weight of creatures inside.",
    "notes": "Damage: Force, Damage, Control, Combat, Consumable ",
    "attunement": "false"
  },
 
  {
    "id": "137",
    "name": "Boots of Elvenkind",
    "type": "Wondrous Item",
    "subtype": "",
    "rarity": "Uncommon",
    "tags": ["Movement","Utility","Deception","Footwear"],
    "description": "While you wear these boots, your steps make false sound, regardless of the surface you are moving across. You also have advantage on Dexterity (Stealth) checks that rely on moving silently.",
    "notes": "Advantage: Stealth, Movement, Utility, Deception, Footwear ",
    "attunement": "false"
  },
 
  {
    "id": "138",
    "name": "Boots of Levitation",
    "type": "Wondrous Item",
    "subtype": "",
    "rarity": "Rare",
    "tags": ["Movement","Utility","Footwear"],
    "description": "While you wear these boots, you can use an action to cast the levitate spell on yourself at will.",
    "notes": "Movement, Utility, Footwear ",
    "attunement": "true"
  },
 
  {
    "id": "139",
    "name": "Boots of Speed",
    "type": "Wondrous Item",
    "subtype": "",
    "rarity": "Rare",
    "tags": ["Buff","Movement","Utility","Footwear"],
    "description": "While you wear these boots, you can use a bonus action and click the boots' heels together. If you do, the boots double your walking speed, and any creature that makes an opportunity attack against you has disadvantage on the attack roll. If you click your heels together again, you end the effect.\nWhen the boots' property has been used for a total of 10 minutes, the magic ceases to function until you finish a long rest.",
    "notes": "Bonus: Speed, Buff, Movement, Utility, Footwear ",
    "attunement": "true"
  },
 
  {
    "id": "140",
    "name": "Boots of Striding and Springing",
    "type": "Wondrous Item",
    "subtype": "",
    "rarity": "Uncommon",
    "tags": ["Buff","Movement","Utility","Footwear"],
    "description": "While you wear these boots, your walking speed becomes 30 feet, unless your walking speed is higher, and your speed isn't reduced if you are encumbered or wearing heavy armor. In addition, you can jump three times the falsermal distance, though you can't jump farther than your remaining movement would allow.",
    "notes": "Set: Innate Speed (Walking), Speed Reduction: Remove, Buff, Movement, Utility, Footwear ",
    "attunement": "true"
  },
 
  {
    "id": "141",
    "name": "Boots of the Winding Path",
    "type": "Wondrous Item",
    "subtype": "",
    "rarity": "Varies",
    "tags": ["Movement","Utility","Footwear","Artificer"],
    "description": "While wearing these boots, a creature can teleport up to 15 feet as a bonus action to an ufalseccupied space the creature can see. The creature must have occupied that space at some  point during the current turn.",
    "notes": "Prerequisite: 4th-level artificer, Movement, Utility, Footwear, Artificer ",
    "attunement": "true"
  },
 
  {
    "id": "142",
    "name": "Bowl of Commanding Water Elementals",
    "type": "Wondrous Item",
    "subtype": "",
    "rarity": "Rare",
    "tags": ["Summoning"],
    "description": "While this bowl is filled with water, you can use an action to speak the bowl's command word and summon a water elemental, as if you had cast the conjure elemental spell. The bowl can't be used this way again until the next dawn.\nThe bowl is about 1 foot in diameter and half as deep. It weighs 3 pounds and holds about 3 gallons.",
    "notes": "Summoning",
    "attunement": "false"
  },
 
  {
    "id": "143",
    "name": "Bracers of Archery",
    "type": "Wondrous Item",
    "subtype": "",
    "rarity": "Uncommon",
    "tags": ["Damage","Buff","Combat","Wristwear"],
    "description": "While wearing these bracers, you have proficiency with the longbow and shortbow, and you gain a +2 bonus to damage rolls on ranged attacks made with such weapons.",
    "notes": "Proficiency: Longbow, Proficiency: Shortbow, Damage: Shortbow, Damage: Longbow, Damage, Buff, Combat, Wristwear ",
    "attunement": "true"
  },
 
  {
    "id": "144",
    "name": "Bracers of Defense",
    "type": "Wondrous Item",
    "subtype": "",
    "rarity": "Rare",
    "tags": ["Warding","Wristwear"],
    "description": "While wearing these bracers, you gain a +2 bonus to AC if you are wearing false armor and using false shield.",
    "notes": "Bonus: Unarmored Armor Class, Warding, Wristwear ",
    "attunement": "true"
  },
 
  {
    "id": "145",
    "name": "Brazier of Commanding Fire Elementals",
    "type": "Wondrous Item",
    "subtype": "",
    "rarity": "Rare",
    "tags": ["Summoning"],
    "description": "While a fire burns in this brass brazier, you can use an action to speak the brazier's command word and summon a fire elemental, as if you had cast the conjure elemental spell. The brazier can't be used this way again until the next dawn.",
    "notes": "Summoning",
    "attunement": "false"
  },
 
  {
    "id": "146",
    "name": "Brooch of Shielding",
    "type": "Wondrous Item",
    "subtype": "",
    "rarity": "Uncommon",
    "tags": ["Warding","Jewelry"],
    "description": "While wearing this brooch, you have resistance to force damage, and you have immunity to damage from the magic missile spell.",
    "notes": "Resistance: Force, Immunity: Force, Warding, Jewelry ",
    "attunement": "true"
  },
 
  {
    "id": "147",
    "name": "Broom of Flying",
    "type": "Wondrous Item",
    "subtype": "",
    "rarity": "Uncommon",
    "tags": ["Movement","Utility","Exploration"],
    "description": "This wooden broom, which weighs 3 pounds, functions like a mundane broom until you stand astride it and speak its command word. It then hovers beneath you and can be ridden in the air. It has a flying speed of 50 feet. It can carry up to 400 pounds, but its flying speed becomes 30 feet while carrying over 200 pounds. The broom stops hovering when you land.\nYou can send the broom to travel alone to a destination within 1 mile of you if you speak the command word, name the location, and are familiar with that place. The broom comes back to you when you speak afalsether command word, provided that the broom is still within 1 mile of you.",
    "notes": "Set: Speed (Flying), Movement, Utility, Exploration ",
    "attunement": "false"
  },
 
  {
    "id": "148",
    "name": "Cape of the Mountebank",
    "type": "Wondrous Item",
    "subtype": "",
    "rarity": "Rare",
    "tags": ["Teleportation","Exploration","Outerwear"],
    "description": "This cape smells faintly of brimstone. While wearing it, you can use it to cast the dimension door spell as an action. This property of the cape can't be used again until the next dawn.\nWhen you disappear, you leave behind a cloud of smoke, and you appear in a similar cloud of smoke at your destination. The smoke lightly obscures the space you left and the space you appear in, and it dissipates at the end of your next turn. A light or stronger wind disperses the smoke.",
    "notes": "Teleportation, Exploration, Outerwear ",
    "attunement": "false"
  },
 
  {
    "id": "149",
    "name": "Censer of Controlling Air Elementals",
    "type": "Wondrous Item",
    "subtype": "",
    "rarity": "Rare",
    "tags": ["Summoning"],
    "description": "While incense is burning in this censer, you can use an action to speak the censer's command word and summon an air elemental, as if you had cast the conjure elemental spell. The censer can't be used this way again until the next dawn.\nThis 6-inch-wide, 1-foot-high vessel resembles a chalice with a decorated lid. It weighs 1 pound.",
    "notes": "Summoning",
    "attunement": "false"
  },
 
  {
    "id": "150",
    "name": "Chime of Opening",
    "type": "Wondrous Item",
    "subtype": "",
    "rarity": "Rare",
    "tags": ["Utility","Exploration","Consumable"],
    "description": "This hollow metal tube measures about 1 foot long and weighs 1 pound. You can strike it as an action, pointing it at an object within 120 feet of you that can be opened, such as a door, lid, or lock. The chime issues a clear tone, and one lock or latch on the object opens unless the sound can't reach the object. If false locks or latches remain, the object itself opens.\nThe chime can be used ten times. After the tenth time, it cracks and becomes useless.",
    "notes": "Utility, Exploration, Consumable ",
    "attunement": "false"
  },
 
  {
    "id": "151",
    "name": "Circlet of Blasting",
    "type": "Wondrous Item",
    "subtype": "",
    "rarity": "Uncommon",
    "tags": ["Damage","Combat","Headwear"],
    "description": "While wearing this circlet, you can use an action to cast the scorching ray spell with it. When you make the spell's attacks, you do so with an attack bonus of +5. The circlet can't be used this way again until the next dawn.",
    "notes": "Damage, Combat, Headwear ",
    "attunement": "false"
  },
 
  {
    "id": "152",
    "name": "Cloak of Displacement",
    "type": "Wondrous Item",
    "subtype": "",
    "rarity": "Rare",
    "tags": ["Deception","Warding","Outerwear"],
    "description": "While you wear this cloak, it projects an illusion that makes you appear to be standing in a place near your actual location, causing any creature to have disadvantage on attack rolls against you. If you take damage, the property ceases to function until the start of your next turn. This property is suppressed while you are incapacitated, restrained, or otherwise unable to move.",
    "notes": "Disadvantage: Attack Rolls Against You, Deception, Warding, Outerwear ",
    "attunement": "true"
  },
 
  {
    "id": "153",
    "name": "Cloak of Elvenkind",
    "type": "Wondrous Item",
    "subtype": "",
    "rarity": "Uncommon",
    "tags": ["Deception","Outerwear"],
    "description": "While you wear this cloak with its hood up, Wisdom (Perception) checks made to see you have disadvantage, and you have advantage on Dexterity (Stealth) checks made to hide, as the cloak's color shifts to camouflage you. Pulling the hood up or down requires an action.",
    "notes": "Advantage: Stealth, Deception, Outerwear ",
    "attunement": "true"
  },
 
  {
    "id": "154",
    "name": "Cloak of Protection",
    "type": "Wondrous Item",
    "subtype": "",
    "rarity": "Uncommon",
    "tags": ["Warding","Outerwear"],
    "description": "You gain a +1 bonus to AC and saving throws while you wear this cloak.",
    "notes": "Bonus: Armor Class, Bonus: Saving Throws, Warding, Outerwear ",
    "attunement": "true"
  }
]
